# RbsElecPanelScheduleFooterNotesParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecPanelScheduleFooterNotesParam Property
ParameterTypeId Class See Also
---
"Schedule Footer Notes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecPanelScheduleFooterNotesParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecPanelScheduleFooterNotesParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecPanelScheduleFooterNotesParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace